import java.util.ArrayList;

public class Main {
    public static void main(String[] args) {

////////////////////////////////////////////////////////////////////////////////////////////////////////////////  создаем и ваводим список
//        ArrayList <String> toDoList = new ArrayList<>();    //создаем список(лист)
//        toDoList.add("Первое дело");                        //добавляем элемент
//        toDoList.add(1, "Второе дело");     // если написать 0, то элемент не заменет, а просто сдвинет, если добавлять через шаг, будет ошибка
//
////        for (int i = 0; i < toDoList.size(); i++)           //выводим значения
////        System.out.println(toDoList.get(i));
//
//        for (String item : toDoList){                      // можно выводить так
//            System.out.println(item);
//        }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////// вариант создания списка + удаление
//        ArrayList <String> toDoList = new ArrayList<>(){{
//           add("первое дело");
//           add("второе дело");
//        }};
//
//        toDoList.remove(0);                          //удаляем
//
//        for (String item : toDoList){                      // можно выводить так
//            System.out.println(item);
//        }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////// задать кол-во элементов списка
//        ArrayList <String> toDoList = new ArrayList<>();
//        toDoList.ensureCapacity(100);
//
//        ArrayList<String> mCatNames = new ArrayList<>(100);              // или так

///////////////////////////////////////////////////////////////////////////////////////////////////////////////// вывести номер элемента
//        ArrayList<String> cats = new ArrayList<>() {{
//            add("Рыжик1");
//            add("Рыжик");
//        }};
//
//        System.out.println(cats.indexOf("Рыжик"));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////// вывести есть такой/нет такого
//        ArrayList<String> cats = new ArrayList<>() {{
//            add("Рыжик1");
//            add("Рыжик");
//        }};
//
//        System.out.println(cats.contains("Рыжик"));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////// удаляем элементы, которые больше 10 и меньше 20
//        numList.removeIf(i -> (i > 10 && i < 20));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////// Заменяем елемент Метод set()
        ArrayList<String> cats = new ArrayList<>() {{
            add("Рыжик1");
            add("Рыжик");
        }};

        for (String item : cats){                      // можно выводить так
            System.out.println(item);
        }

        cats.set(0,"Мурка");

        for (String item : cats){                      // можно выводить так
            System.out.println(item);
        }

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////// Метод clear() - очистка массива
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////// Метод toArray() - конвертируем в обычный массив

    }
}
